---
kind: property
id: P:Autodesk.Revit.DB.DividedPath.IsCyclical
source: html/05cde18c-9c25-2c38-ca87-0217935de21f.htm
---
# Autodesk.Revit.DB.DividedPath.IsCyclical Property

True if the first and last point coincide
 False otherwise.

## Syntax (C#)
```csharp
public bool IsCyclical { get; }
```